{
  "main": [
    {
      "title": "Hello to you !",
      "subtitle": "I'm a creative developer",
      "teaser": "“ Transform your ideas into unique visual experiences “"
    }
  ],
  "skills": [
    {
      "teaser": "Coding is like drawing. Each line has its importance, every detail matters."
    },
    {
      "skillTable": [
        {
          "title": "CodeCraft",
          "tools": [
            {
              "name": "Github",
              "icon": "Skills_Github.svg"
            },
            {
              "name": "Tailwind",
              "icon": "Skills_Tailwind.svg"
            }
          ]
        },
        {
          "title": "Frameworks",
          "tools": [
            {
              "name": "Next.js / React",
              "icon": "Skills_React.svg"
            },
            {
              "name": "Vue.js",
              "icon": "Skills_Vue.svg"
            },
            {
              "name": "Symfony",
              "icon": "Skills_Symfony.svg"
            },
            {
              "name": "Wordpress",
              "icon": "Skills_Wordpress.svg"
            }
          ]
        },
        {
          "title": "Code",
          "tools": [
            {
              "name": "Javascript",
              "icon": "Skills_JavaScript.svg"
            },
            {
              "name": "Typescript",
              "icon": "Skills_TypeScript.svg"
            },
            {
              "name": "SQL",
              "icon": "Skills_SQL.svg"
            },
            {
              "name": "PHP",
              "icon": "Skills_PHP.svg"
            }
          ]
        },
        {
          "title": "Design",
          "tools": [
            {
              "name": "Illustrator",
              "icon": "Skills_Illustrator.svg"
            },
            {
              "name": "Photoshop",
              "icon": "Skills_Photoshop.svg"
            },
            {
              "name": "Figma",
              "icon": "Skills_Figma.svg"
            },
            {
              "name": "Sketchup",
              "icon": "Skills_Sketchup.svg"
            }
          ]
        }
      ]
    }
  ],
  "services": [
    {
      "teaser": "Transform your ideas into digital reality with our tailored services."
    },
    {
      "servicesTable": [
        {
          "title": "Front-End Web Development :",
          "icon": "Services_Dev.svg",
          "description": [
            "Responsive website design: Creation of websites optimised for a fluid user experience on all devices.",
            "HTML/CSS integration: Transformation of graphic models into clean, efficient HTML/CSS code.",
            "JavaScript development: Adding interactive and dynamic functionalities using libraries or frameworks such as React or Vue.js."
          ]
        },
        {
          "title": "Graphic design :",
          "icon": "Services_Design.svg",
          "description": [
            "Memorable Logos: Create a lasting first impression with distinctive logos that reflect the unique essence of your brand.",
            "Dazzling UI: Enhance the visual appeal of your site with carefully designed graphic elements, ensuring a memorable user experience.",
            "Visual Prototypes: Visualise the future of your project with striking mock-ups and prototypes, allowing you to fine-tune every detail before the big launch."
          ]
        },
        {
          "title": "Drawing and Illustration :",
          "icon": "Services_Illustration.svg",
          "description": [
            "Bespoke Art: Turn your ideas into personalised works of art, whether for web illustrations, portraits or character designs.",
            "Unlimited Creativity: Bring a unique touch to your project with illustrations and drawings that captivate and inspire.",
            "Visual Personality: Bring your content to life with original characters that add a visual and narrative dimension to your story."
          ]
        },
        {
          "title": "Creativity and Consulting :",
          "icon": "Services_Creativity.svg",
          "description": [
            "Targeted Design: Maximise your brand's impact with design and user experience consultancy, optimising every interaction.",
            "Powerful Visual Identity: Create a strong, memorable brand identity that stands out from the competition."
          ]
        }
      ]
    }
  ],
  "projects": [
    {
      "teaser": "Coding is like drawing. Each line has its importance, every detail matters."
    },
    {
      "projectsTable": [
        {
          "title": "SpaceTrip",
          "tools": "Symfony, Twig, CSS, JavaScript",
          "Description": "This slightly eccentric project is a vision of what a site booking travel to one of the 8 Mars stations run by the company 'SpaceTrip' could offer. Users are invited to find out about activities and places related to the discovery of Mars. They can then log in to access their dashboard, which they can update, and the travel booking page. They can then select different criteria to personalise their trip. The aim was to create an application with a DBMS on the back-end. I used MySQL and Doctrine. The project offers server-side rendering and the whole thing is dynamised with vanilla JavaScript.",
          "Challenges": "The biggest challenge of this project was undoubtedly being able to display static and dynamic content in a fluid way. Using Twig, which is a server-side rendering engine, made the experience a little slower and we had to optimise images, resource compression and server-side caching in order to speed up view loading."
        },
        {
          "title": "L'Épicerise",
          "tools": "Symfony, Next.js, SCSS,",
          "Description": "This project was an E-commerce site developed during my web developer training. The goal was to create an application for selling grocery products using the CRUD method and API calls. As a team of three working on this project, we divided tasks to develop the necessary features within the given timeframe. The project included a dynamic search bar, product categories, and a complete user journey for a shopping cart, including the payment method.",
          "Challenges": "One of the most challenging aspects was integrating a PHP back-end framework with a JavaScript front-end framework, especially dealing with asynchronous communication between the two. We utilized REST APIs to address this. The routing systems also differed between the frameworks, and we had to configure them by adhering to a strict naming convention. On the back-end, we used controllers, while on the front-end, we defined routes using useRouter."
        },
        {
          "title": "Novus",
          "tools": "WordPress",
          "Description": "This project is an online digital comic book E-commerce platform. It revolves around my Novus project: a narrative set in an imperial hegemony where non-belief is penalized. In this fantastical, baroque-style universe filled with magic and occult forces, the main character strives to dismantle economic, social, and political disparities. The narrative is enriched with a romantic relationship entwined in epic battles.",
          "Challenges": "Being my first website project developed with a Content Management System (CMS), I faced challenges primarily due to being self-taught and not yet fully acquainted with web languages."
        },
        {
          "title": "Cosi-Immo",
          "tools": "Vue.js",
          "Description": "This entirely client-side project was an application designed for a real estate developer. The goal was to create an application for purchasing or estimating various types of real estate, including houses or apartments. The application featured a multi-question system providing diverse options such as apartment type, size, number of bedrooms, budget range, locations via the Google API, and more. The ultimate objective was to submit these requests through the sending of a summary email and the generation of a PDF file consolidating all the information provided by the user.",
          "Challenges": "With no need to manage the server-side of the project, particularly a database, the primary challenge lay in establishing a robust form validation approach. It required linking fields according to Vue.js's built-in directives. Adding conditions, displaying error messages, all of this prior to validation. Considering the comprehensive nature of the form, maintaining a clear convention was crucial for efficiently retrieving all the values selected by the user."
        }
      ]
    }
  ]
}
